<template>
	<div class="furniture">
    <ul>
      <li class="first-li" v-for="(vitem, vindex) in msg" :key="vindex">
        <h3>{{vitem.title}}</h3>
        <p v-if="vitem.content" v-for="(witem, windex) in vitem.content" :key="windex">{{witem}}</p>
        <ul v-if="vitem.notice" class="notice">
          <h5>{{vitem.notice.title}}</h5>
          <li v-for="(xitem, xindex) in vitem.notice.content" :key="xindex">{{xitem}}</li>
        </ul>
        <table v-if="vitem.table">
          <tbody>
            <tr v-for="(witem, windex) in vitem.table" :key="windex">
              <td v-for="(val, i) in witem" :key="i">{{val}}</td>
            </tr>
          </tbody>
        </table>
        <ul v-if="vitem.question">
          <li v-for="(xitem, xindex) in vitem.question" :key="xindex">
            <h4>{{xitem.title}}</h4>
            <p v-if="xitem.content" v-for="(val, i) in xitem.content" :key="i">{{val}}</p>
            <template v-if="xitem.table">
              <table>
                <tbody>
                  <tr v-for="(witem, windex) in xitem.table.body" :key="windex">
                    <td v-for="(val, i) in witem" :key="i">{{val}}</td>
                  </tr>
                </tbody>
              </table>
              <p>{{xitem.table.foot}}</p>
            </template>
            <template v-if="xitem.notice">
              <h5>{{xitem.notice.title}}</h5>
              <p v-for="(val, i) in xitem.notice.content" :key="i">{{val}}</p>
            </template>
          </li>
        </ul>
      </li>
      <p class="explain">*注 :以上最终解释权归瓴里所有</p>
    </ul>
	</div>
</template>
<script>
  export default {
    data(){
      return{
        msg: [
          {
            title: '配送范围和时间',
            table: [
              ['类型', '配送范围', '配送时间'],
              ['小件家具', '大陆地区顺丰包邮。（港奥台、海外地区暂不派送） 超出配送区域的，免费发至最近的服务网点，客户自行提货。', '下单付款后，24小时内发货（预售商品、双11/618等促销期间商品以及详情页有特别标注发货时间的商品除外） 送达时效以顺丰快递实际配送为准。'],
              ['大件家具或定制商品', '目前只开通上海地区（含崇明三岛）免费送装服务。', '交货周期为订单付款成功后60天，您可以通过APP或工作人员提前确认需要交货的具体日期与时间段，以及物流查询配送信息']
            ]
          },
          {
            title: '付款方式',
            content: ['微信和、支付宝、银行电汇和到店POS机刷卡']
          },
          {
            title: '大件家具收货流程',
            notice: {
              title: '在大件家具送装前, 我们可以为您提供免费上门勘察服务，主要包括车辆通行、入户条件、家具室内摆放位置、保护准备等。请您在收货时，仔细检查一下您所购买的产品，注意请在运输人员在场的情况下确认：',
              content: [
                '1.务必先确定货物外包装的完好，且对您购买的每一件产品进行开箱验收，但请不要破坏原包装。',
                '2.如物流公司不配合，或者您在验收过程中发现因外包装问题而导致内部商品出现破损，少件等问题时，请拒绝签收，并立即致电客服进行处理。',
                '3. 如未进行验收即做签收，将认定已对商品进行了当面验收，并按照正常签收标准为处理售后问题。',
                '4.在您家中无人且在您认可和允许可入户的情况下，瓴里亦可提供上门送装服务。',
                '5.支持他人代收，委托他人代收的行为等同于本人对商品进行签收。',
                '6.使用无尘安装设备，最大程度避免因安装作业造成的灰尘污染。',
                '7.安装完成后进行现场清洁整理。 8.商品交付后代为保管商品包装30天，以备您发生退换货时使用。'
              ]
            }
          },
          {
            title: '免费仓储',
            content: ['在订购完商品后，瓴里提供最长60天免费仓储服务，若超60天后按每件商品20元/天收取费用。']
          },
          {
            title: '保价政策',
            content: ['自下单起15天内，若主站／App上的产品价格出现折扣或有其他形式的促销活动，可以申请价格保护；每张订单可以享受一次价格保护，可联系客服提出申请。 折扣差价及活动差价将以无限期全场优惠券的形式，返还到账户，可在购买时抵用。指定渠道的特殊活动（如门店独享、推广活动等），不在主站／App价格保护政策范围之内。']
          },
          {
            title: '逾期赔付承诺',
            content: ['瓴里承诺100%准时发货， 但若有紧急情况导致发货日期必须延迟， 为客户的损失以积分形式按每日订单金额千分之一发放到用户账户上，最高返还逾期产品金额10%的积分，积分会次日发放。']
          },
          {
            title: '三包售后服务',
            content: [
              '质保为期一年，首年免费。三包服务以产品实际签收日期为起始日。 质保期内，产品在正常使用和维护的情况下出现问题，经检测若属于产品质量问题，将提供免费维修服务，直至问题解决。',
              '商品退换 ,“三包”质保服务范围内，若产品在正常使用过程中出现质量问题，我们将按照以下标准解决问题： a. 维修：在“三包”期限内，产品出现质量问题，瓴里将负责免费维修；b. 更换：在“三包”期限内，若同一问题经两次维修后仍未能解决，我们将更换产品；c. 退货：在“三包”期限内， 同一产品经两次更换后，仍无法达到质量标准的，您可以选择更换其他同类产品或退货。',
            ],
            notice: {
              title: '以下几种情况不属于三包范围：',
              content: [
                '1.因拍摄设备、显示器、光线等原因产生的色差，不属于商品质量问题。',
                '2.因商品测量标准不一致导致的尺寸问题，在相关标准规定的尺寸误差内，不属于商品质量问题。',
                '3.材料，工艺产生的天然瑕疵，不属于商品质量问题',
                '4.未按照瓴里标准收货程序签收，拆包不当造成的损坏；由于不正当使用产品或部件而造成的人身和财产损失。',
                '5.未按照瓴里产品组装说明书操作，错误组装造成的产品损坏；未按照组装说明书要求，自行更换部件造成的损坏；',
                '6.客户自行拆装、调换产品，或在错误的环境使用造成的损坏。',
                '7.不正确的维护保养，或未按照瓴里“产品使用和保养手册”操作导致的损坏；非专业人士修理导致的损坏其它使用，维 护，保管不当及人为损坏的情况。',
                '8.客户不能提供购买发票与保修卡，或者擅自涂改保修卡。',
                '9.因其它不可抗拒力（地震，火灾）等造成的产品损坏。',
                '10.玻璃镜子发生霉变和雾光的三包期限为六个月，处理家具商品只享受包修服务。'
              ]
            }
          },
          {
            title: 'FAQ服务条款',
            question: [
              {
                title: 'Q:瓴里平台下订单，是否可以开发票？',
                content: ['A:可以，需要开具发票请联系客服，请提供开具发票抬头，公司税号和签收发票地址。如需开具公司增值税专用发票，需要提供开票信息和相关公司资质证明。']
              },
              {
                title: 'Q:瓴里平台用积分购买订单，是否可以开发票？',
                content: ['A:如果订单金额全部以积分抵扣是无法开具发票的。开具发票条件是用户使用现金购买商品的消费金额，凡是用积分，折扣券，赠品等等优惠金额都不能开具发票。']
              },
              {
                title: 'Q:瓴里哪家物流公司配送？',
                content: ['A:我们是顺丰快递和第三物流进行配送，家具大件商品第三物流进行配送，您可以在APP上查询配送相关信息。']
              },
              {
                title: 'Q:下订单后，收货地址发生更变怎么办？',
                content: ['A:如果你更变任何订单信息（比如收货人，收货地址，派送时间等），请直接联系客服。']
              },
              {
                title: 'Q:下订单后，是否可以享受7天无理由退换货？',
                content: ['A:自确认收货之日起7天内，可联系客户申请无理由退换服务，7天无理由退换标准：'],
                table: {
                  body: [
                    ['退换类别', '具体描述', '是否支持7天无理由退换货', '是否收取退回运费'],
                    ['国家法律所规定的功能性故障或商品质量问题', '经由生产厂家指定或特约售后服务中心检测确认，并出具检测报告或经客服确认属于商品质量问题', '是', '否'],
                    ['运输过程中产生损坏、漏发错发等原因或商品描述与实际不符', '运输过程中造成的损坏、漏液、破碎、性能故障等请于收到货后24小时内反馈，经核查情况属实。（漏发错发指商品原装配件缺失或者错发商品）', '是', '否'],
                    ['其他等个人原因', '除以上两种原因之外，如个人原因导致的退换货，原包装、配件、吊牌标识等完好，商品和配件无磨损和污渍、无使用和水洗痕迹，产品未经安装组装及使用、包装完整不影响二次销售的前提下', '是', '否']
                  ],
                  foot: '注：床品，贴身衣物、定制类商品等特殊商品不支持7天无理由退换货，若无质量问题，恕不退换。'
                }
              },
              {
                title: 'Q:商品超7天如何进行退换货流程的操作？',
                content: [
                  'A:超过7天商品属于正常三包范围，可以享受退换货',
                  '退货流程:联系客服申请退货-用户寄出货品-联系客服反馈物流信息-仓库验收入库-财务退款或退回积分 换货流程:联系客服申请换货-用户寄出货品-联系客服反馈物流信息-仓库验收入库-仓库寄出新商品-用户收货'
                ]
              },
              {
                title: 'Q:商城退换过程中要注意什么？',
                notice: {
                  title: '为了让流程走更加快捷，操作注意以下几点： • 对于商品质量问题，需向瓴里客服提供证据，客服收到证据后，将按质量“三包”标准进行办理。若确实产生退换货，应在妥善包装后退回商品，并在商品中附上用户信息及订单号，返回方式及地址与客服确认；',
                  content: [
                    '如退换货订单中包含赠品，需将赠品寄回，若赠品破损或遗失，需扣除赠品价值等额的货款，若已经开具发票而发票遗失，则相应的退税点（16%）需由您承担；',
                    '收到寄回的产品后，将确定货物情况，与顾客确认换货或退货完成，如因顾客包装不善造成的货损，需由顾客承担； •因退换货产生退款，现金部分将通过原支付方式退回，优惠券和积分将退回账户，原有效期不变。若有其他的问题，请及时与客服确认。'
                  ]
                }
              },
              {
                title: 'Q:退货退款周期多久？',
                content: ['A:商品退入仓库验收后3-5个工作日。']
              }
            ]
          }
        ]
      };
    }
  };
</script>
